---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CableTray
zh: 桥架、线槽
source: html/86d92fdc-69d4-ce86-5222-8cc2a8073132.htm
---
# Autodesk.Revit.DB.Electrical.CableTray

**中文**: 桥架、线槽

This class represents a cable tray in Autodesk Revit.

## Syntax (C#)
```csharp
public class CableTray : CableTrayConduitBase
```